# Skrypt Syntezyjący
# Użycie:		>cd \yosys-win32-mxebin-0.9
#				>yosys with_flatten.ys
# Diagram zostanie zapisany do pliku show.dot
# schemat do cmos_gate_adder.v


# read design
read_verilog adder.v
hierarchy  -top  adder


# high-level synthesis
opt_clean; fsm_map; flatten

techmap;

# low-level synthesis


# map to target architecture
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib



write_verilog with_flatten.v
show