# Skrypt Syntezyjący
# Użycie:		>cd \yosys-win32-mxebin-0.9
#				>yosys with_flatten_3.ys
# Diagram zostanie zapisany do pliku show.dot

read_verilog adder.v

synth -flatten
proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib

splitnets -ports; opt

write_verilog with_flatten_3.v
show
