
# Skrypt Syntezyjący
# Użycie:		>cd \yosys-win32-mxebin-0.9
#				>yosys rtl_netlist.ys
# Diagram zostanie zapisany do pliku show.dot
# schemat do rtl_adder.v

# read design
read_verilog adder.v
hierarchy -check -top adder

proc; opt; fsm; opt; memory; opt

write_verilog rtl_adder.v
show 